---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeReferenceOptions.#ctor
source: html/c6be020b-aa28-86c1-1063-301a6129be3d.htm
---
# Autodesk.Revit.DB.DirectShapeReferenceOptions.#ctor Method

Constructs a new DirectShapeRefOptions instance with default settings.

## Syntax (C#)
```csharp
public DirectShapeReferenceOptions()
```